Tekla.Structures.Model.GridCylindricalSurface
The GridCylindricalSurface class defines a user defined (possibly magnetic) cylindrical surface helping in
modeling work. A grid cylindrical surface must always belong to a parent grid instance.
using System;
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public bool Example1()
{
var cylindricalSurface = new GridCylindricalSurface();
Arc cylinderBase = new Arc(new Point(0,0,0), new Point(6000,0,0), new Vector(0,0,1), Math.PI);
double cylinderHeight = 6000.0;
cylindricalSurface.CylinderBase = cylinderBase;
cylindricalSurface.CylinderHeight = cylinderHeight;
return cylindricalSurface.Insert();
}
}

Tekla.Structures.Model.GridCylindricalSurface.CylinderBase
The arc that represents the base of the cylindrical surface. The cylinder is then extruded along the normal
direction of the arc, with the height given by Tekla.Structures.Model.GridCylindricalSurface.CylinderHeight"

Tekla.Structures.Model.GridCylindricalSurface.CylinderHeight
Height of the cylinder along the normal direction of the Tekla.Structures.Model.GridCylindricalSurface.CylinderBase arc.

Tekla.Structures.Model.GridCylindricalSurface.#ctor
Creates a new grid plane instance.
The default values are as follows:
CylinderBase = new Arc(new Point(0, 0, 0), new Point(6000, 0, 0), new Vector(0, 0, 1), Math.PI);
CylinderHeight = 6000.0;
Label = "Default";
IsMagnetic = false;
ExtensionLeft  = 2000.0;
ExtensionRight = 2000.0;
ExtensionBelow = 2000.0;
ExtensionAbove = 2000.0;
DrawingVisibility = false;

Tekla.Structures.Model.GridCylindricalSurface.#ctor(Tekla.Structures.Geometry3d.Arc,System.Double,System.String)
Creates a new grid plane instance taking the plane and label as input.
cylinderBase: The base of the cylinder.
cylinderHeight: The height of the cylinder.
label: The label for the grid plane.

Tekla.Structures.Model.GridCylindricalSurface.Modify
Modifies the grid plane with the given ID.
Returns: True on success.

Tekla.Structures.Model.GridCylindricalSurface.ToStruct(Tekla.Structures.ModelInternal.dotGridPlane_t@)
Fills the struct to transport information to Core.
dotPlane: Struct to be filled

Tekla.Structures.Model.GridCylindricalSurface.FromStruct(Tekla.Structures.ModelInternal.dotGridPlane_t@)
Sets the current instance from a struct transported from Core.
dotPlane: Struct get the data from